{
  "about": {
    "name": "Reece Fannon",
    "title": "Data Analyst and Math Enthusiast",
    "bio": "I have a Bachelor's in Mathematics and Statistics and a Master's in Statistics from Miami University in Oxford, Ohio. I am deeply interested in data science, data analysis and pretty much all branches of mathematics. I use math and statistics to solve problems and questions that I am interested in, even random ones. I will be uploading my projects to this page to serve as a compendium of my works.",
    "photo": "imgs/thatsMe.jpg",
    "email": "reece.fannon@outlook.com",
    "location": "Ohio, USA",
    "social": {
      "github": "https://github.com/reecefannon",
      "linkedin": "https://linkedin.com/in/reecefannon"
    }
  },
  "projects": [
    {
      "id": "blood-pressure",
      "title": "Comparative Analysis of Effectiveness of Three Systolic Blood Pressure Medications",
      "author": "Reece Fannon",
      "date": "14 September 2024",
      "abstract": "This report presents an analysis comparing the effectiveness of three different drugs in reducing systolic blood pressure (SBP). Twelve subjects were each assigned one of three SBP medications, and their SBP was recorded both before and after the treatment period. An Analysis of Covariance (ANCOVA) model is used to evaluate the relative effectiveness of each drug while accounting for initial SBP levels. Additionally, a permutation test is conducted to assess whether subjects were randomly assigned to treatments. The report concludes with a discussion of the limitations inherent to small-sample studies and the challenges posed by limited experimental information.",
      "tags": ["Data Analysis", "Experimental Design", "ANOVA", "ANCOVA", "Permutation Test", "Small Sample", "R"],
      "file": "files/Systolic%20Blood%20Pressure%20Medications.html",
      "code_url": "",
      "thumbnail": "imgs/heart.png"
    },
    {
      "id": "gas-consumption",
      "title": "Estimating Total Gas Consumption of Miami University Commuters",
      "author": "Reece Fannon & Nick Baroun",
      "date": "11 October 2024",
      "abstract": "This report estimates the total mileage and gasoline consumption of commuters to Miami University Oxford, Ohio campus. The estimates were derived from survey results of students, staff and faculty applying for parking permits using the Universities parking permit portal. Due to the nature of the survey responses and the requirement that all identifying information being removed from the data (such as names, addresses, vehicle make and model), many assumptions had to be made to give fair but still accurate estimates aligned with the University's goals of reducing net emissions. This project highlights the necessity of making assumptions and how these assumptions can affect the results of an analysis, as well as some subtleties when estimating totals, as opposed to means.",
      "tags": ["Data Analysis", "Survey", "Estimation", "Confidence Intervals", "Assumptions", "R"],
      "file": "files/MU%20Commuter%20Gas%20Consumption.html",
      "code_url": "",
      "thumbnail": "imgs/gasoline.png"
    },
    {
      "id": "fungal-morphogenesis",
      "title": "Inhibition of Hyphal Formation in Candida albicans by Aloe aborescens-Derived Compounds",
      "author": "Reece Fannon",
      "date": "6 November 2024",
      "abstract": "This report addresses several hypotheses concerning the anti-fungal properties of various compounds derived from <i>Aloe aborescens</i>. Petri dishes of <i>Candida albicans</i>, a common fungal pathogen that can cause yeast infections, were exposed natural aloe-based or artifical, commercially sourced compounds, and the counts of cells exhibiting various morphological structures were counted. Of interest to us were the effects on <i>hyphae</i>. A quasi-binomial model was used to conduct hypothesis tests using contrasts.",
      "tags": ["Data Analysis", "Experiment", "Contrasts", "GLM", "Hypothesis Testing", "R"],
      "file": "files/Fungal%20Morphogenesis%20Study.html",
      "code_url": "",
      "thumbnail": "imgs/aloe.png"
    },
    {
      "id": "lakes-icecover",
      "title": "Investigating Trends in the Last 50 Years of Ice Coverage at the Great Lakes",
      "author": "Reece Fannon & Colin Smith",
      "date": "20 November 2024",
      "abstract": "This report investigates whether ice coverage of the Great Lakes surface water has experienced a significant deline over the past 50 years. We estimate the trend line of the annual cumulative ice cover ratios (CICR) from ice cover percentage data, gathered by the Great Lakes Environmental Research Laboratory (GLERL) starting from 1973, using a non-parametric Theil-Sen line estimator. Our choice of the annual CICR differs from the use of annual maximum coverage reported by GLERL and illustrates the nuance in selecting an appropriate unit of measure for performing an analysis.",
      "tags": ["Data Analysis", "Time Series", "Regression", "Non-Parametric", "Measurement Selection", "R"],
      "file": "files/Great%20Lakes%20Ice%20Coverage.html",
      "code_url": "",
      "thumbnail": "imgs/greatlakes.png"
    },
    {
      "id": "traffic-stops",
      "title": "Assessing Racial Disparities in Traffic Enforcement by the Louisville Metro Police Department",
      "author": "Reece Fannon",
      "date": "12 December 2024",
      "abstract": "This project was originally a presentation, which I rebuilt using <i>Quarto</i>. I added text-heavy slides to act as a substitute for the verbal component of the presentation. This project investigates racial disparities in traffic stops and searches conducted by the Louisville Metro Police Department (LMPD) in 2021 and 2022 using a spatial conditional autoregressive (CAR) model.",
      "tags": ["Data Analysis", "Bayesian", "Spatial", "Spatial Regression", "CAR", "R"],
      "file": "files/LMPD%20Traffic%20Stops/LMPD%20Traffic%20Stops.html",
      "code_url": "",
      "thumbnail": "imgs/police.png"
    },
    {
      "id": "correlation-test",
      "title": "Hypothesis Tests on the Correlation Coefficient",
      "author": "Reece Fannon",
      "date": "11 October 2024",
      "abstract": "This report was originally created during my regression course in Fall 2021. I updated and repurposed the report during my second year as a graduate assistantship when one of the regression students asked about the relationship between the slope and the correlation coefficient. My response to that student was this report, and I shared this report with the rest of the class. The report details how the slope and correlation coefficient between two random variables are related to each other, and derives a sampling distribution of the correlation coefficient from which we can conduct hypothesis tests. We verify the validity of the derivations using a simple simulation study.",
      "tags": ["Statistical Inference", "Regression", "Hypothesis Testing", "R"],
      "file": "files/Testing%20Correlation%20Instead%20of%20Slope.html",
      "code_url": "",
      "thumbnail": "imgs/scatterplot.png"
    },
    {
      "id": "ANCH-flowers",
      "title": "Optimal Flower Breeding Paths in Animal Crossing: New Horizons",
      "author": "Reece Fannon",
      "date": "23 April 2023",
      "abstract": "This project is currently not being actively worked on. This project was originally created Spring 2022 but the github repository was not created until much later, when I decided that some of my projects should be archived and shared somewhere. The idea for this project spawned during my brutal journey of breeding a flower of every possible phenotype in Animal Crossing: New Horizons for the Nintendo Switch. That process involved weeks and weeks of mindless resetting the game and moving the console clock forward to all rainy days on my island's weather seed. I used some guides to help me breed certain phenotypes faster, but I thought about how those guides figured out their recipes, and if they were truly optimal. Hence, this project was born (a year and a half later)",
      "tags": ["Markov Chains", "Decision Trees", "Assumptions", "Python", "R", "Gaming"],
      "file": "",
      "code_url": "https://github.com/reeceFannon/ACNH-Breeding-Policies",
      "thumbnail": "imgs/ACNH_leaf.png"
    }
  ]
}
